hit-iz-web/src/test/resources/soapMessages/ConnectivityTest_Request.xml

<?xml version='1.0' encoding='UTF-8'?>
<Envelope  xmlns="http://www.w3.org/2003/05/soap-envelope" xmlns:urn="urn:cdc:iisb:2011">
  <Header/>
  <Body>
    <urn:connectivityTest>
      <urn:echoBack>Hello world!</urn:echoBack>   
    </urn:connectivityTest>
  </Body>
</Envelope>
