hit-iz-web/src/test/resources/soapMessages/1.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:urn="urn:cdc:iisb:2011">
   <soap:Header/>
   <soap:Body>
      <urn:connectivityTest>
         <urn:echoBack>Hello world</urn:echoBack>
      </urn:connectivityTest>
   </soap:Body>
</soap:Envelope>