hit-iz-web/client/app/resources/connectivity/connectivityTestRequest.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns="http://www.w3.org/2003/05/soap-envelope">
    <env:Header/>
    <env:Body>
        <submitSingleMessage xmlns="urn:cdc:iisb:2011">
            <username>vendor_2</username>
            <password>vendor_2</password>
            <facilityID>vendor_2</facilityID>
            <hl7Message>MSH|^~\&amp;|Test EHR Application|X68||NIST Test Iz Reg|201207010822||VXU^V04^VXU_V04|NIST-IZ-007.00|P|2.5.1|||AL|ER&#xD;PID|1||MR-99922^^^NIST MPI^MR||Montgomery^Lewis^^^^^L||20010821|M&#xD;ORC|RE||IZ-783276^NDA&#xD;RXA|0|1|20110215||118^HPV^CVX|999|||01^Historical information - source unspecified^NIP001</hl7Message>
        </submitSingleMessage>
    </env:Body>
</env:Envelope>