hit-iz-service/src/test/resources/soap/validSubmitSingleMessage.xml

<?xml version='1.0' encoding='UTF-8'?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope">
   <Header />
   <Body>
      <submitSingleMessage xmlns="urn:cdc:iisb:2011">
         <username>X</username>
         <password>Y</password>
         <facilityID>Z</facilityID>
         <hl7Message>W</hl7Message>
      </submitSingleMessage>
   </Body>
</Envelope>
