hit-iz-service/src/main/resources/templates/SubmitSingleMessage.xml

<?xml version='1.0' encoding='UTF-8'?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope">
   <Header />
   <Body>
      <submitSingleMessage xmlns="urn:cdc:iisb:2011">
         <username></username>
         <password></password>
         <facilityID></facilityID>
         <hl7Message></hl7Message>
      </submitSingleMessage>
   </Body>
</Envelope>
